In [11]:
import pandas

In [12]:
df= pandas.DataFrame()

In [13]:
df

Empty DataFrame
Columns: []
Index: []

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 0 entries
Empty DataFrame

In [15]:
city=['Berlin','Elrangen','Daka']  # this is list
city

['Berlin', 'Elrangen', 'Daka']

In [16]:
# List convert to DataFrame
df= pandas.DataFrame(city)
df

          0
0    Berlin
1  Elrangen
2      Daka

In [17]:
type(df)  #chek type

pandas.core.frame.DataFrame

In [18]:
type(city)

list

In [19]:
row,col = df.shape

In [20]:
row

3

In [21]:
col

1

In [23]:
df.shape  #first row then col

(3, 1)

In [24]:
df

          0
0    Berlin
1  Elrangen
2      Daka

In [26]:
df= pandas.DataFrame(city,columns=['City_in_Europ'])   #set col name
df

  City_in_Europ
0        Berlin
1      Elrangen
2          Daka

In [28]:
df= pandas.DataFrame(city,columns=['City in_Europ'],index=['c1','c2','c3'])   #set row name
df

   City in_Europ
c1        Berlin
c2      Elrangen
c3          Daka

In [29]:
df= pandas.DataFrame(city,columns=['City in_Europ'],index=['c1','c2','c3'])   #set row name
df

   City in_Europ
c1        Berlin
c2      Elrangen
c3          Daka

In [30]:
city2 =['Daka','Rajshahi','Chittagong']

In [35]:
df2=pandas.DataFrame(city2)
df2

            0
0        Daka
1    Rajshahi
2  Chittagong

In [36]:
df2=pandas.DataFrame(city2,index=['a','b','c'],columns=['Division of BD'])
df2

  Division of BD
a           Daka
b       Rajshahi
c     Chittagong

In [37]:
df3=pandas.DataFrame(zip(city,city2),columns=['city1','city2'])   # zip
df3

      city1       city2
0    Berlin        Daka
1  Elrangen    Rajshahi
2      Daka  Chittagong

In [38]:
df3.shape

(3, 2)

In [39]:
city3 = [['Bavaria','Erlangen'],['NRW','Doctmund']]

In [40]:
city3

[['Bavaria', 'Erlangen'], ['NRW', 'Doctmund']]

In [41]:
df4=pandas.DataFrame(city3) # Two Dimensional
df4

         0         1
0  Bavaria  Erlangen
1      NRW  Doctmund

In [43]:
df4=pandas.DataFrame(city3,columns=['state','city']) # Two Dimensional
df4

     state      city
0  Bavaria  Erlangen
1      NRW  Doctmund

In [45]:
# Dictionary use second {} bracket
dict1={
    'city1': city,
    'city2': city2
}

In [46]:
dict1

{'city1': ['Berlin', 'Elrangen', 'Daka'],
 'city2': ['Daka', 'Rajshahi', 'Chittagong']}

In [47]:
df5 =pandas.DataFrame(dict1)
df5

      city1       city2
0    Berlin        Daka
1  Elrangen    Rajshahi
2      Daka  Chittagong

In [48]:
type(dict1)

dict